performance/reports/runs/posts-2026-08-05T08-49-51/summary.txt
     ✓ login 200
     ✓ post list 200
     ✓ post detail 200
     ✓ post search 200
     ✓ post create 2xx
     ✓ post update 200
     ✓ post delete 200

   ✓ checks.........................: 100.00% ✓ 947      ✗ 0   
     data_received..................: 1.1 MB  11 kB/s
     data_sent......................: 342 kB  3.3 kB/s
     http_req_blocked...............: avg=24.71µs  min=0s      med=0s      max=1.67ms   p(90)=0s       p(95)=0s       p(99)=1ms     
     http_req_connecting............: avg=12.4µs   min=0s      med=0s      max=1ms      p(90)=0s       p(95)=0s       p(99)=1ms     
     http_req_duration..............: avg=80.93ms  min=2.75ms  med=11.62ms max=2.47s    p(90)=89.13ms  p(95)=160.78ms p(99)=1.94s   
       { expected_response:true }...: avg=80.93ms  min=2.75ms  med=11.62ms max=2.47s    p(90)=89.13ms  p(95)=160.78ms p(99)=1.94s   
     ✓ { feature:auth }.............: avg=141.72ms min=71.67ms med=84.04ms max=871.84ms p(90)=315.1ms  p(95)=522.36ms p(99)=871.14ms
     ✓ { feature:board }............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:chat }.............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:comment }..........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:friend }...........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:hot }..............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:mypage }...........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:notification }.....: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:post }.............: avg=65.17ms  min=2.75ms  med=9.43ms  max=2.47s    p(90)=26.03ms  p(95)=51.14ms  p(99)=2s      
     ✓ { feature:reaction }.........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:school }...........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:scrap }............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:timetable }........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✗ { op:read }..................: avg=67.37ms  min=2.75ms  med=9.13ms  max=2.47s    p(90)=22.62ms  p(95)=51.47ms  p(99)=2s      
     ✓ { op:write }.................: avg=120.87ms min=16.43ms med=80.59ms max=871.84ms p(90)=150.51ms p(95)=401.63ms p(99)=871.09ms
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 947 
     http_req_receiving.............: avg=679.83µs min=0s      med=0s      max=84.42ms  p(90)=0s       p(95)=567.3µs  p(99)=1.5ms   
     http_req_sending...............: avg=10.95µs  min=0s      med=0s      max=997.3µs  p(90)=0s       p(95)=0s       p(99)=514.94µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=80.24ms  min=2.75ms  med=11.6ms  max=2.47s    p(90)=89.13ms  p(95)=160.78ms p(99)=1.9s    
     http_reqs......................: 947     9.088524/s
     iteration_duration.............: avg=9.85s    min=4.13s   med=9.44s   max=17.83s   p(90)=13.2s    p(95)=14.71s   p(99)=16.82s  
     iterations.....................: 195     1.871449/s
     vus............................: 1       min=1      max=20
     vus_max........................: 20      min=20     max=20